---
kind: method
id: M:Autodesk.Revit.DB.MassInstanceUtils.Dispose
source: html/9bbe22ab-2538-b238-9eba-4777cb91f012.htm
---
# Autodesk.Revit.DB.MassInstanceUtils.Dispose Method

Releases all resources used by the MassInstanceUtils

## Syntax (C#)
```csharp
public void Dispose()
```